{
  "projects": [
    {
      "id": "pixa_vista",
      "title": "Pixa Vista",
      "subtitle": "Personalize device screens with high quality wallpapers.",
      "subtitleTwoLines": "PixaVista is a wallpaper app that offers a vast collection of high-quality images, allowing users to personalize their device's home and lock screens effortlessly.",
      "productImage": "assets/images/application_assets/1_mockup_thumbnail/pixa_vista_mockup.png",
      "projectDetailsUrl": "screens/project_details.html",
      "projectGithubLink": "https://github.com/ShinasNajeerKoya/PixaVista-ElevateYourScreenStyle",
      "description": [
        "PixaVista is a feature-rich wallpaper app designed to elevate the style of your device's screen. It offers a vast collection of high-quality images, allowing users to discover and set stunning wallpapers that reflect their personal tastes and moods. The app's search functionality makes it easy to find specific wallpapers by keywords or categories, while predefined categories help users explore themed collections effortlessly.",
        "One of the standout advantages of PixaVista is its user-friendly interface, which enables quick and easy customization of home and lock screens. Users can set their favorite wallpapers with a single tap and save them to their device's gallery for offline access or sharing. The app also includes customization options such as cropping and scaling, ensuring that wallpapers fit perfectly on any device screen.",
        "PixaVista is perfect for anyone looking to personalize their device, from casual users who enjoy changing their wallpapers frequently to those seeking specific themes for special occasions or moods. The app’s intuitive design and vast selection cater to various preferences, making it accessible and enjoyable for a wide audience.",
        "The app is easy to install and run, with straightforward setup instructions and a seamless user experience. By following a few simple steps, users can clone the repository, configure the necessary permissions in the Android Manifest, and start exploring the extensive wallpaper collection. PixaVista is an excellent tool for enhancing the visual appeal of any device, providing a delightful and personalized experience for all its users."
      ],
      "snapshots": [
        "../assets/images/application_assets/pixa_vista/pixa_vista_home_page.png",
        "../assets/images/application_assets/pixa_vista/pixa_vista_category_results_1.png",
        "../assets/images/application_assets/pixa_vista/pixa_vista_category_results_2.png",
        "../assets/images/application_assets/pixa_vista/pixa_vista_full_screen.png",
        "../assets/images/application_assets/pixa_vista/pixa_vista_search_results_1.png",
        "../assets/images/application_assets/pixa_vista/pixa_vista_search_results_2.png",
        "../assets/images/application_assets/pixa_vista/pixa_vista_loading_screen_1.png",
        "../assets/images/application_assets/pixa_vista/pixa_vista_loading_screen_2.png",
        "../assets/images/application_assets/pixa_vista/pixa_vista_no_internet_error.png",
        "../assets/images/application_assets/pixa_vista/pixa_vista_page_not_found_error.png",
        "../assets/images/application_assets/pixa_vista/pixa_vista_saved_images.png",
        "../assets/images/application_assets/pixa_vista/pixa_vista_saved_notification.png",
        "../assets/images/application_assets/pixa_vista/pixa_vista_search_results_3.png",
        "../assets/images/application_assets/pixa_vista/pixa_vista_splash_screen_1.png",
        "../assets/images/application_assets/pixa_vista/pixa_vista_splash_screen_2.png"
      ],
      "skills": [
        "Flutter",
        "Dart",
        "Firebase",
        "Figma",
        "Postman API",
        "GIT",
        "Github",
        "Android Studio"
      ]
    },
    {
      "id": "note_trove",
      "title": "Note Trove",
      "subtitle": "Effortlessly Organize Your Notes with Intuitive Management.",
      "subtitleTwoLines": "An intuitive note-taking app with powerful organization and customization features, designed to enhance productivity and creativity.",
      "productImage": "assets/images/application_assets/1_mockup_thumbnail/notetrove_mockup.png",
      "projectDetailsUrl": "screens/project_details.html",
      "projectGithubLink": "https://github.com/ShinasNajeerKoya/NoteTrove_OrganizeYourThoughts",
      "description": [
        "NoteTrove is a comprehensive note-taking application designed to facilitate the seamless organization and management of notes. It empowers users to create, edit, export, import, and categorize their notes effortlessly. With a user-friendly interface and a range of customization options including colors and background images, NoteTrove enhances productivity by allowing users to tailor their note-taking experience to personal preferences.",
        "This app is widely utilized by individuals across various domains such as students, professionals, creatives, and anyone needing to organize their thoughts and ideas efficiently. Its versatility makes it suitable for personal use, academic purposes, professional environments, and creative projects alike.",
        "The key advantages of NoteTrove include its intuitive functionality, which simplifies the process of creating and editing notes. Users can easily export and import notes, ensuring seamless accessibility across different devices and platforms. The ability to categorize notes enables efficient organization by topics, projects, or any customized criteria, further enhancing productivity and clarity of thought.",
        "Ideal for those seeking to streamline their workflow and enhance organizational skills, NoteTrove offers robust error handling to ensure a reliable user experience. Its accessibility features make it suitable for users of all levels of technical proficiency, from novices to experienced professionals.",
        "Whether for capturing ideas on the go, maintaining study notes, managing tasks, or documenting creative inspirations, NoteTrove stands out as a versatile tool that integrates seamlessly into daily routines. Its appeal lies in its ability to adapt to individual needs while providing a structured approach to note-taking, making it an indispensable companion for enhancing productivity and staying organized effectively."
      ],
      "snapshots": [
        "../assets/images/application_assets/note_trove/note_trove_homepage_2.png",
        "../assets/images/application_assets/note_trove/note_trove_create_note_page.png",
        "../assets/images/application_assets/note_trove/note_trove_delete_confirmation.png",
        "../assets/images/application_assets/note_trove/note_trove_edit_note_page.png",
        "../assets/images/application_assets/note_trove/note_trove_homepage_1.png",
        "../assets/images/application_assets/note_trove/note_trove_edit_loading_animation.png",
        "../assets/images/application_assets/note_trove/note_trove_save_confirmation.png",
        "../assets/images/application_assets/note_trove/note_trove_splash_1.png",
        "../assets/images/application_assets/note_trove/note_trove_splash_2.png",
        "../assets/images/application_assets/note_trove/note_trove_loading_animation.png",
        "../assets/images/application_assets/note_trove/note_trove_no_internet_error.png",
        "../assets/images/application_assets/note_trove/note_trove_notes_list.png",
        "../assets/images/application_assets/note_trove/note_trove_page_not_found_error.png"
      ],
      "skills": [
        "Flutter",
        "Dart",
        "Firebase",
        "Figma",
        "Dribbble",
        "GIT",
        "Github",
        "Lottie Animation",
        "Android Studio"
      ]
    },
    {
      "id": "flamingo",
      "title": "Flamingo.",
      "subtitle": "Elevate Your Document Viewing Experience With A Single Gesture.",
      "subtitleTwoLines": "Transform your document viewing experience with seamless gestures for efficiency and ease with Flamingo!",
      "productImage": "assets/images/application_assets/1_mockup_thumbnail/flamingo_mockup.png",
      "projectDetailsUrl": "screens/project_details.html",
      "projectGithubLink": "https://github.com/ShinasNajeerKoya/Flamingo-YourPersonalDocumentReader",
      "description": [
        "Flamingo - Your Personal Document Reader is an innovative application designed to streamline access and viewing of PDF and Word documents directly from local storage. It stands out with its user-friendly interface and robust feature set, making document management effortless and efficient. Whether for casual reading or professional documentation, Flamingo supports a wide range of file formats, including .pdf and .doc/.docx, ensuring flexibility in handling various document types.",
        "Ideal for individuals and professionals alike, Flamingo simplifies document management by offering intuitive tools for document access and navigation. Users can effortlessly open files by tapping the \"Open PDF File\" or \"Open Word File\" buttons and selecting documents stored on their device. This straightforward process ensures quick access to essential documents, enhancing productivity on the go.",
        "The application's smooth page scrolling and dedicated navigation buttons facilitate easy transitions between pages, providing a seamless reading experience. It includes error handling mechanisms to guide users through any issues encountered during document selection, ensuring a smooth user experience. These features make Flamingo a valuable tool in educational, corporate, and personal settings, catering to diverse document management needs.",
        "Flamingo welcomes community contributions and feedback, fostering continuous improvement and adaptation to user requirements. With its MIT License, the project promotes collaboration and ensures broad accessibility. Whether for enhancing productivity in professional workflows or simplifying document access in daily tasks, Flamingo offers a reliable solution for efficient document viewing and management."
      ],
      "snapshots": [
        "../assets/images/application_assets/flamingo/flamingo_onboarding_page.png",
        "../assets/images/application_assets/flamingo/flamingo_homepage.png",
        "../assets/images/application_assets/flamingo/flamingo_homepage_recent_2.png",
        "../assets/images/application_assets/flamingo/flamingo_permission.png",
        "../assets/images/application_assets/flamingo/flamingo_page_not_found.png",
        "../assets/images/application_assets/flamingo/flamingo_homepage_recent_1.png",
        "../assets/images/application_assets/flamingo/flamingo_pdf_selection.png",
        "../assets/images/application_assets/flamingo/flamingo_pdf_view_1.png",
        "../assets/images/application_assets/flamingo/flamingo_no_internet.png",
        "../assets/images/application_assets/flamingo/flamingo_pdf_view_2.png"
      ],
      "skills": [
        "Flutter",
        "Dart",
        "Figma",
        "Dribbble",
        "GIT",
        "Github",
        "Android Studio"
      ]
    },
    {
      "id": "savory_safari",
      "title": "Savory Safari",
      "subtitle": "Discover Culinary Delights with SavorySafari!..",
      "subtitleTwoLines": "Dive Into the World of Culinary Delights with SavorySafari - Your Ultimate Recipe Companion!",
      "productImage": "assets/images/application_assets/1_mockup_thumbnail/savorysafari_mockup.png",
      "projectDetailsUrl": "screens/project_details.html",
      "projectGithubLink": "https://github.com/ShinasNajeerKoya/SavorySafari_YourCulinaryAdventureBeginsHere",
      "description": [
        "SavorySafari is your essential culinary app, offering a wide array of recipes for all cooking levels. Discover dishes by ingredient, cuisine, or explore categories like Paneer, Grills, and Bread. Perfect for home cooks and chefs alike, it provides easy access to a global collection of recipes, bringing diverse flavors to your kitchen with ease.",
        "Designed for food enthusiasts, SavorySafari helps home cooks, professionals, and health-conscious users find detailed nutritional information. Its user-friendly design simplifies searching, browsing, and bookmarking. Each recipe includes ingredient lists, step-by-step instructions, and calorie counts, presented in an engaging and visually appealing format that enhances your cooking experience.",
        "SavorySafari surpasses traditional recipe books with up-to-date content and detailed nutritional insights. Its dynamic search function and real-time updates ensure a constantly refreshed culinary experience. Whether for daily meals or new experiments, SavorySafari makes cooking enjoyable and accessible, providing inspiration and convenience at your fingertips.",
        "Embrace the future of culinary exploration with SavorySafari, where every recipe is a journey and every meal a celebration of flavors. Its intuitive interface is perfect for meal planning, special occasions, or exploring new flavors. With SavorySafari, you have a world of culinary delight at your fingertips, transforming your cooking into an adventure."
      ],
      "snapshots": [
        "../assets/images/application_assets/savory_safari/savory_safari_onboarding_page.png",
        "../assets/images/application_assets/savory_safari/savory_safari_home_page.png",
        "../assets/images/application_assets/savory_safari/savory_safari_search_indian.png",
        "../assets/images/application_assets/savory_safari/savory_safari_webview2.png",
        "../assets/images/application_assets/savory_safari/savory_safari_loading_homepage.png",
        "../assets/images/application_assets/savory_safari/savory_safari_homepage2.png",
        "../assets/images/application_assets/savory_safari/savory_safari_no_results.png",
        "../assets/images/application_assets/savory_safari/savory_safari_webview3.png",
        "../assets/images/application_assets/savory_safari/savory_safari_details_ingredients.png",
        "../assets/images/application_assets/savory_safari/savory_safari_details_steps.png",
        "../assets/images/application_assets/savory_safari/savory_safari_homepage3.png",
        "../assets/images/application_assets/savory_safari/savory_safari_search_french.png",
        "../assets/images/application_assets/savory_safari/savory_safari_search_page.png",
        "../assets/images/application_assets/savory_safari/savory_safari_webview_page.png"
      ],
      "skills": [
        "Dart",
        "flutter",
        "Postman API",
        "GIT",
        "Github"
      ]
    },
    {
      "id": "task_hive",
      "title": "Task Hive",
      "subtitle": "Simplify Your Daily Task Management Effortlessly.",
      "subtitleTwoLines": "TaskHive is a sleek and intuitive daily task planner designed for productivity enthusiasts. It's the perfect companion for anyone looking to stay organized and on top of their daily to-dos.",
      "productImage": "assets/images/application_assets/1_mockup_thumbnail/task_hive_mockup.png",
      "projectGithubLink": "https://github.com/ShinasNajeerKoya/TaskHive_YourDailyTaskPlanner",
      "projectDetailsUrl": "screens/project_details.html",
      "description": [
        "TaskHive: Your Daily Task Planner is an intuitive app designed to streamline daily task management. Ideal for boosting productivity and staying organized, TaskHive offers a seamless experience for adding, saving, and deleting tasks. It’s perfect for students, professionals, and anyone with a busy schedule needing efficient task tracking.",
        "Use TaskHive whenever you need to organize your day, whether for work, school, or personal errands. Open the app, tap \"Add\" to input tasks, and save them to stay on top of responsibilities. TaskHive simplifies managing daily activities, allowing you to focus on what truly matters without the hassle of remembering every detail.",
        "TaskHive stands out for its simplicity and effectiveness. It avoids unnecessary complexity, providing just what you need. With shared preferences, your tasks are saved locally, making it reliable even offline. The app’s clean design and custom fonts enhance the user experience, making task management enjoyable.",
        "Anyone needing a straightforward task planner can benefit from TaskHive. Whether you’re a student, professional, or busy parent, TaskHive is tailored to meet your needs. Its ease of use and reliability make it a must-have tool for enhancing productivity and staying organized in daily life. As a developer, I'm proud to offer this efficient solution to help you conquer your day with ease."
      ],
      "snapshots": [
        "../assets/images/application_assets/task_hive/task_hive_splash.png",
        "../assets/images/application_assets/task_hive/task_hive_home.png",
        "../assets/images/application_assets/task_hive/task_hive_open_menu.png",
        "../assets/images/application_assets/task_hive/task_hive_task_assign.png",
        "../assets/images/application_assets/task_hive/task_hive_task_list2.png",
        "../assets/images/application_assets/task_hive/task_hive_task_selection.png",
        "../assets/images/application_assets/task_hive/task_hive_button_info1.png",
        "../assets/images/application_assets/task_hive/task_hive_button_info2.png",
        "../assets/images/application_assets/task_hive/task_hive_task.png",
        "../assets/images/application_assets/task_hive/task_hive_task_list.png"
      ],
      "skills": [
        "Dart",
        "Flutter",
        "Figma",
        "Lottie Animation",
        "GIT",
        "Dribbble",
        "Github"
      ]
    },
    {
      "id": "clear_sky",
      "title": "Clear Sky",
      "subtitle": "Application to get your High Quality wallpaper within a single click.",
      "subtitleTwoLines": "Application to get your High Quality wallpaper within a single click. Application to get your High Quality wallpaper within a single click.",
      "productImage": "assets/images/application_assets/1_mockup_thumbnail/clear_sky_mockup.png",
      "projectDetailsUrl": "screens/project_details.html",
      "projectGithubLink": "https://github.com/rammcodes/dopefolio",
      "description": "PixaVista is an Open-Source project which is a simple and clean multi-page portfolio website template for developers. I created this project for developers to quickly build a good-looking and fast-performing multi-page portfolio without having to code their portfolio from scratch.",
      "snapshots": [
        "../assets/images/application_assets/iPhone 13 Max.png",
        "../assets/images/application_assets/iPhone 13 Max.png",
        "../assets/images/application_assets/iPhone 13 Max.png",
        "../assets/images/application_assets/iPhone 13 Max.png",
        "../assets/images/application_assets/iPhone 13 Max.png",
        "../assets/images/application_assets/iPhone 13 Max.png"
      ],
      "skills": [
        "Dart",
        "flutter",
        "firebase",
        "jira",
        "GIT",
        "Github",
        "bitbucket"
      ]
    }
  ]
}
